Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CCM.h
#define CCM_CLOCK_GROUP_STATUS1_UP_DONE_MASK     (0x8000000U)
#define CCM_CLOCK_GROUP_STATUS1_UP_DONE_SHIFT    (27U)
/*! UP_DONE - Clock frequency increase complete
 *  0b0..Handshake signal with GPC status indicating frequency increase is not complete
 *  0b1..Handshake signal with GPC status indicating frequency increase is complete
 */
#define CCM_CLOCK_GROUP_STATUS1_UP_DONE(x)       (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_STATUS1_UP_DONE_SHIFT)) & CCM_CLOCK_GROUP_STATUS1_UP_DONE_MASK)
/*! @} */

/* The count of CCM_CLOCK_GROUP_STATUS1 */
#define CCM_CLOCK_GROUP_STATUS1_COUNT            (2U)

/*! @name CLOCK_GROUP_CONFIG - Clock group configuration */
/*! @{ */

#define CCM_CLOCK_GROUP_CONFIG_SETPOINT_PRESENT_MASK (0x10U)
#define CCM_CLOCK_GROUP_CONFIG_SETPOINT_PRESENT_SHIFT (4U)
/*! SETPOINT_PRESENT - Setpoint present
 *  0b0..Setpoint is not implemented.
 *  0b1..Setpoint is implemented.
 */
#define CCM_CLOCK_GROUP_CONFIG_SETPOINT_PRESENT(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_CONFIG_SETPOINT_PRESENT_SHIFT)) & CCM_CLOCK_GROUP_CONFIG_SETPOINT_PRESENT_MASK)
/*! @} */

/* The count of CCM_CLOCK_GROUP_CONFIG */
#define CCM_CLOCK_GROUP_CONFIG_COUNT             (2U)

/*! @name CLOCK_GROUP_AUTHEN - Clock group access control */
/*! @{ */

#define CCM_CLOCK_GROUP_AUTHEN_TZ_USER_MASK      (0x1U)
#define CCM_CLOCK_GROUP_AUTHEN_TZ_USER_SHIFT     (0U)
/*! TZ_USER - User access
 *  0b0..Clock cannot be changed in user mode.
 *  0b1..Clock can be changed in user mode.
 */
#define CCM_CLOCK_GROUP_AUTHEN_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_TZ_USER_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_TZ_USER_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_TZ_NS_MASK        (0x2U)
#define CCM_CLOCK_GROUP_AUTHEN_TZ_NS_SHIFT       (1U)
/*! TZ_NS - Non-secure access
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_CLOCK_GROUP_AUTHEN_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_TZ_NS_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_TZ_NS_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_LOCK_TZ_MASK      (0x10U)
#define CCM_CLOCK_GROUP_AUTHEN_LOCK_TZ_SHIFT     (4U)
/*! LOCK_TZ - Lock truszone setting
 *  0b0..Trustzone setting is not locked.
 *  0b1..Trustzone setting is locked.
 */
#define CCM_CLOCK_GROUP_AUTHEN_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_LOCK_TZ_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_LOCK_TZ_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_WHITE_LIST_MASK   (0xF00U)
#define CCM_CLOCK_GROUP_AUTHEN_WHITE_LIST_SHIFT  (8U)
/*! WHITE_LIST - Whitelist */
#define CCM_CLOCK_GROUP_AUTHEN_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_WHITE_LIST_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_WHITE_LIST_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_LOCK_LIST_MASK    (0x1000U)
#define CCM_CLOCK_GROUP_AUTHEN_LOCK_LIST_SHIFT   (12U)
/*! LOCK_LIST - Lock Whitelist
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_CLOCK_GROUP_AUTHEN_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_LOCK_LIST_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_LOCK_LIST_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_DOMAIN_MODE_MASK  (0x10000U)
#define CCM_CLOCK_GROUP_AUTHEN_DOMAIN_MODE_SHIFT (16U)
/*! DOMAIN_MODE - Low power and access control by domain
 *  0b0..Clock does not work in Domain Mode.
 *  0b1..Clock works in Domain Mode.
 */
#define CCM_CLOCK_GROUP_AUTHEN_DOMAIN_MODE(x)    (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_DOMAIN_MODE_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_DOMAIN_MODE_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_SETPOINT_MODE_MASK (0x20000U)
#define CCM_CLOCK_GROUP_AUTHEN_SETPOINT_MODE_SHIFT (17U)
/*! SETPOINT_MODE - Low power and access control by Setpoint */
#define CCM_CLOCK_GROUP_AUTHEN_SETPOINT_MODE(x)  (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_SETPOINT_MODE_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_SETPOINT_MODE_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_LOCK_MODE_MASK    (0x100000U)
#define CCM_CLOCK_GROUP_AUTHEN_LOCK_MODE_SHIFT   (20U)
/*! LOCK_MODE - Lock low power and access mode
 *  0b0..MODE is not locked.
 *  0b1..MODE is locked.
 */
#define CCM_CLOCK_GROUP_AUTHEN_LOCK_MODE(x)      (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_LOCK_MODE_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_LOCK_MODE_MASK)
/*! @} */

/* The count of CCM_CLOCK_GROUP_AUTHEN */
#define CCM_CLOCK_GROUP_AUTHEN_COUNT             (2U)

/*! @name CLOCK_GROUP_AUTHEN_SET - Clock group access control */
/*! @{ */

#define CCM_CLOCK_GROUP_AUTHEN_SET_TZ_USER_MASK  (0x1U)
#define CCM_CLOCK_GROUP_AUTHEN_SET_TZ_USER_SHIFT (0U)
/*! TZ_USER - User access */
#define CCM_CLOCK_GROUP_AUTHEN_SET_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_SET_TZ_USER_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_SET_TZ_NS_MASK    (0x2U)
#define CCM_CLOCK_GROUP_AUTHEN_SET_TZ_NS_SHIFT   (1U)
/*! TZ_NS - Non-secure access */
#define CCM_CLOCK_GROUP_AUTHEN_SET_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_SET_TZ_NS_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_TZ_MASK  (0x10U)
#define CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_TZ_SHIFT (4U)
/*! LOCK_TZ - Lock truszone setting */
#define CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_SET_WHITE_LIST_MASK (0xF00U)
#define CCM_CLOCK_GROUP_AUTHEN_SET_WHITE_LIST_SHIFT (8U)
/*! WHITE_LIST - Whitelist */
#define CCM_CLOCK_GROUP_AUTHEN_SET_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_SET_WHITE_LIST_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_SET_WHITE_LIST_MASK)

#define CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_LIST_MASK (0x1000U)
#define CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_LIST_SHIFT (12U)
/*! LOCK_LIST - Lock Whitelist */
#define CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_CLOCK_GROUP_AUTHEN_SET_LOCK_LIST_MASK)

