Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CCM.h
#define CCM_OSCPLL_STATUS1_SETPOINT_OFF_DONE_MASK (0x2000000U)
#define CCM_OSCPLL_STATUS1_SETPOINT_OFF_DONE_SHIFT (25U)
/*! SETPOINT_OFF_DONE - Clock source turn off finish from GPC Setpoint
 *  0b0..Clock source is not turned off
 *  0b1..Clock source is turned off
 */
#define CCM_OSCPLL_STATUS1_SETPOINT_OFF_DONE(x)  (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_SETPOINT_OFF_DONE_SHIFT)) & CCM_OSCPLL_STATUS1_SETPOINT_OFF_DONE_MASK)

#define CCM_OSCPLL_STATUS1_SETPOINT_ON_REQUEST_MASK (0x4000000U)
#define CCM_OSCPLL_STATUS1_SETPOINT_ON_REQUEST_SHIFT (26U)
/*! SETPOINT_ON_REQUEST - Clock gate turn on request from GPC Setpoint
 *  0b0..No request
 *  0b1..Clock gate requested to be turned on
 */
#define CCM_OSCPLL_STATUS1_SETPOINT_ON_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_SETPOINT_ON_REQUEST_SHIFT)) & CCM_OSCPLL_STATUS1_SETPOINT_ON_REQUEST_MASK)

#define CCM_OSCPLL_STATUS1_SETPOINT_ON_DONE_MASK (0x8000000U)
#define CCM_OSCPLL_STATUS1_SETPOINT_ON_DONE_SHIFT (27U)
/*! SETPOINT_ON_DONE - Clock gate turn on finish from GPC Setpoint
 *  0b0..No request
 *  0b1..Request to turn on clock gate
 */
#define CCM_OSCPLL_STATUS1_SETPOINT_ON_DONE(x)   (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_SETPOINT_ON_DONE_SHIFT)) & CCM_OSCPLL_STATUS1_SETPOINT_ON_DONE_MASK)

#define CCM_OSCPLL_STATUS1_STANDBY_IN_REQUEST_MASK (0x10000000U)
#define CCM_OSCPLL_STATUS1_STANDBY_IN_REQUEST_SHIFT (28U)
/*! STANDBY_IN_REQUEST - Clock gate turn off request from GPC standby
 *  0b0..No request
 *  0b1..Clock gate requested to be turned off
 */
#define CCM_OSCPLL_STATUS1_STANDBY_IN_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_STANDBY_IN_REQUEST_SHIFT)) & CCM_OSCPLL_STATUS1_STANDBY_IN_REQUEST_MASK)

#define CCM_OSCPLL_STATUS1_STANDBY_IN_DONE_MASK  (0x20000000U)
#define CCM_OSCPLL_STATUS1_STANDBY_IN_DONE_SHIFT (29U)
/*! STANDBY_IN_DONE - Clock source turn off finish from GPC standby
 *  0b0..Clock source is not turned off
 *  0b1..Clock source is turned off
 */
#define CCM_OSCPLL_STATUS1_STANDBY_IN_DONE(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_STANDBY_IN_DONE_SHIFT)) & CCM_OSCPLL_STATUS1_STANDBY_IN_DONE_MASK)

#define CCM_OSCPLL_STATUS1_STANDBY_OUT_DONE_MASK (0x40000000U)
#define CCM_OSCPLL_STATUS1_STANDBY_OUT_DONE_SHIFT (30U)
/*! STANDBY_OUT_DONE - Clock gate turn on finish from GPC standby
 *  0b0..Request to turn on Clock gate is not complete
 *  0b1..Request to turn on Clock gate is complete
 */
#define CCM_OSCPLL_STATUS1_STANDBY_OUT_DONE(x)   (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_STANDBY_OUT_DONE_SHIFT)) & CCM_OSCPLL_STATUS1_STANDBY_OUT_DONE_MASK)

#define CCM_OSCPLL_STATUS1_STANDBY_OUT_REQUEST_MASK (0x80000000U)
#define CCM_OSCPLL_STATUS1_STANDBY_OUT_REQUEST_SHIFT (31U)
/*! STANDBY_OUT_REQUEST - Clock gate turn on request from GPC standby
 *  0b0..No request
 *  0b1..Clock gate requested to be turned on
 */
#define CCM_OSCPLL_STATUS1_STANDBY_OUT_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_STATUS1_STANDBY_OUT_REQUEST_SHIFT)) & CCM_OSCPLL_STATUS1_STANDBY_OUT_REQUEST_MASK)
/*! @} */

/* The count of CCM_OSCPLL_STATUS1 */
#define CCM_OSCPLL_STATUS1_COUNT                 (29U)

/*! @name OSCPLL_CONFIG - Clock source configuration */
/*! @{ */

#define CCM_OSCPLL_CONFIG_AUTOMODE_PRESENT_MASK  (0x2U)
#define CCM_OSCPLL_CONFIG_AUTOMODE_PRESENT_SHIFT (1U)
/*! AUTOMODE_PRESENT - Automode Present
 *  0b0..Not present
 *  0b1..Present
 */
#define CCM_OSCPLL_CONFIG_AUTOMODE_PRESENT(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_CONFIG_AUTOMODE_PRESENT_SHIFT)) & CCM_OSCPLL_CONFIG_AUTOMODE_PRESENT_MASK)

#define CCM_OSCPLL_CONFIG_SETPOINT_PRESENT_MASK  (0x10U)
#define CCM_OSCPLL_CONFIG_SETPOINT_PRESENT_SHIFT (4U)
/*! SETPOINT_PRESENT - Setpoint present
 *  0b0..Setpoint is not implemented.
 *  0b1..Setpoint is implemented.
 */
#define CCM_OSCPLL_CONFIG_SETPOINT_PRESENT(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_CONFIG_SETPOINT_PRESENT_SHIFT)) & CCM_OSCPLL_CONFIG_SETPOINT_PRESENT_MASK)
/*! @} */

/* The count of CCM_OSCPLL_CONFIG */
#define CCM_OSCPLL_CONFIG_COUNT                  (29U)

/*! @name OSCPLL_AUTHEN - Clock source access control */
/*! @{ */

#define CCM_OSCPLL_AUTHEN_TZ_USER_MASK           (0x1U)
#define CCM_OSCPLL_AUTHEN_TZ_USER_SHIFT          (0U)
/*! TZ_USER - User access
 *  0b0..Clock cannot be changed in user mode.
 *  0b1..Clock can be changed in user mode.
 */
#define CCM_OSCPLL_AUTHEN_TZ_USER(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_TZ_USER_SHIFT)) & CCM_OSCPLL_AUTHEN_TZ_USER_MASK)

#define CCM_OSCPLL_AUTHEN_TZ_NS_MASK             (0x2U)
#define CCM_OSCPLL_AUTHEN_TZ_NS_SHIFT            (1U)
/*! TZ_NS - Non-secure access
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_OSCPLL_AUTHEN_TZ_NS(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_TZ_NS_SHIFT)) & CCM_OSCPLL_AUTHEN_TZ_NS_MASK)

#define CCM_OSCPLL_AUTHEN_LOCK_TZ_MASK           (0x10U)
#define CCM_OSCPLL_AUTHEN_LOCK_TZ_SHIFT          (4U)
/*! LOCK_TZ - lock truszone setting
 *  0b0..Trustzone setting is not locked.
 *  0b1..Trustzone setting is locked.
 */
#define CCM_OSCPLL_AUTHEN_LOCK_TZ(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_LOCK_TZ_SHIFT)) & CCM_OSCPLL_AUTHEN_LOCK_TZ_MASK)

#define CCM_OSCPLL_AUTHEN_WHITE_LIST_MASK        (0xF00U)
#define CCM_OSCPLL_AUTHEN_WHITE_LIST_SHIFT       (8U)
/*! WHITE_LIST - Whitelist */
#define CCM_OSCPLL_AUTHEN_WHITE_LIST(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_WHITE_LIST_SHIFT)) & CCM_OSCPLL_AUTHEN_WHITE_LIST_MASK)

#define CCM_OSCPLL_AUTHEN_LOCK_LIST_MASK         (0x1000U)
#define CCM_OSCPLL_AUTHEN_LOCK_LIST_SHIFT        (12U)
/*! LOCK_LIST - Lock Whitelist
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_OSCPLL_AUTHEN_LOCK_LIST(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_LOCK_LIST_SHIFT)) & CCM_OSCPLL_AUTHEN_LOCK_LIST_MASK)

#define CCM_OSCPLL_AUTHEN_DOMAIN_MODE_MASK       (0x10000U)
#define CCM_OSCPLL_AUTHEN_DOMAIN_MODE_SHIFT      (16U)
/*! DOMAIN_MODE - Low power and access control by domain
 *  0b0..Clock does not work in Domain Mode.
 *  0b1..Clock works in Domain Mode.
 */
#define CCM_OSCPLL_AUTHEN_DOMAIN_MODE(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OSCPLL_AUTHEN_DOMAIN_MODE_SHIFT)) & CCM_OSCPLL_AUTHEN_DOMAIN_MODE_MASK)

