Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CCM.h
/* The count of CCM_LPCG_SETPOINT */
#define CCM_LPCG_SETPOINT_COUNT                  (138U)

/*! @name LPCG_STATUS0 - LPCG working status */
/*! @{ */

#define CCM_LPCG_STATUS0_ON_MASK                 (0x1U)
#define CCM_LPCG_STATUS0_ON_SHIFT                (0U)
/*! ON - LPCG current state
 *  0b0..LPCG is OFF.
 *  0b1..LPCG is ON.
 */
#define CCM_LPCG_STATUS0_ON(x)                   (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS0_ON_SHIFT)) & CCM_LPCG_STATUS0_ON_MASK)

#define CCM_LPCG_STATUS0_ACTIVE_DOMAIN_MASK      (0xF00U)
#define CCM_LPCG_STATUS0_ACTIVE_DOMAIN_SHIFT     (8U)
/*! ACTIVE_DOMAIN - Domains that own this clock gate
 *  0b0000..Clock not owned by any domain
 *  0b0001..Clock owned by Domain0
 *  0b0010..Clock owned by Domain1
 *  0b0011..Clock owned by Domain0 and Domain1
 *  0b0100..Clock owned by Domain2
 *  0b0101..Clock owned by Domain0 and Domain2
 *  0b0110..Clock owned by Domain1 and Domain2
 *  0b0111..Clock owned by Domain0, Domain1 and Domain 2
 *  0b1000..Clock owned by Domain3
 *  0b1001..Clock owned by Domain0 and Domain3
 *  0b1010..Clock owned by Domain1 and Domain3
 *  0b1011..Clock owned by Domain2 and Domain3
 *  0b1100..Clock owned by Domain0, Domain 1, and Domain3
 *  0b1101..Clock owned by Domain0, Domain 2, and Domain3
 *  0b1110..Clock owned by Domain1, Domain 2, and Domain3
 *  0b1111..Clock owned by all domains
 */
#define CCM_LPCG_STATUS0_ACTIVE_DOMAIN(x)        (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS0_ACTIVE_DOMAIN_SHIFT)) & CCM_LPCG_STATUS0_ACTIVE_DOMAIN_MASK)

#define CCM_LPCG_STATUS0_DOMAIN_ENABLE_MASK      (0xF000U)
#define CCM_LPCG_STATUS0_DOMAIN_ENABLE_SHIFT     (12U)
/*! DOMAIN_ENABLE - Enable status from each domain
 *  0b0000..No domain request
 *  0b0001..Request from Domain0
 *  0b0010..Request from Domain1
 *  0b0011..Request from Domain0 and Domain1
 *  0b0100..Request from Domain2
 *  0b0101..Request from Domain0 and Domain2
 *  0b0110..Request from Domain1 and Domain2
 *  0b0111..Request from Domain0, Domain1 and Domain 2
 *  0b1000..Request from Domain3
 *  0b1001..Request from Domain0 and Domain3
 *  0b1010..Request from Domain1 and Domain3
 *  0b1011..Request from Domain2 and Domain3
 *  0b1100..Request from Domain0, Domain 1, and Domain3
 *  0b1101..Request from Domain0, Domain 2, and Domain3
 *  0b1110..Request from Domain1, Domain 2, and Domain3
 *  0b1111..Request from all domains
 */
#define CCM_LPCG_STATUS0_DOMAIN_ENABLE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS0_DOMAIN_ENABLE_SHIFT)) & CCM_LPCG_STATUS0_DOMAIN_ENABLE_MASK)
/*! @} */

/* The count of CCM_LPCG_STATUS0 */
#define CCM_LPCG_STATUS0_COUNT                   (138U)

/*! @name LPCG_STATUS1 - LPCG low power status */
/*! @{ */

#define CCM_LPCG_STATUS1_CPU0_MODE_MASK          (0x3U)
#define CCM_LPCG_STATUS1_CPU0_MODE_SHIFT         (0U)
/*! CPU0_MODE - Domain0 Low Power Mode
 *  0b00..Run
 *  0b01..Wait
 *  0b10..Stop
 *  0b11..Suspend
 */
#define CCM_LPCG_STATUS1_CPU0_MODE(x)            (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU0_MODE_SHIFT)) & CCM_LPCG_STATUS1_CPU0_MODE_MASK)

#define CCM_LPCG_STATUS1_CPU0_MODE_REQUEST_MASK  (0x4U)
#define CCM_LPCG_STATUS1_CPU0_MODE_REQUEST_SHIFT (2U)
/*! CPU0_MODE_REQUEST - Domain0 request enter Low Power Mode
 *  0b0..No request
 *  0b1..Request from domain to enter Low Power Mode
 */
#define CCM_LPCG_STATUS1_CPU0_MODE_REQUEST(x)    (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU0_MODE_REQUEST_SHIFT)) & CCM_LPCG_STATUS1_CPU0_MODE_REQUEST_MASK)

#define CCM_LPCG_STATUS1_CPU0_MODE_DONE_MASK     (0x8U)
#define CCM_LPCG_STATUS1_CPU0_MODE_DONE_SHIFT    (3U)
/*! CPU0_MODE_DONE - Domain0 Low Power Mode task done
 *  0b0..Clock is not gated
 *  0b1..Clock is gated-off
 */
#define CCM_LPCG_STATUS1_CPU0_MODE_DONE(x)       (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU0_MODE_DONE_SHIFT)) & CCM_LPCG_STATUS1_CPU0_MODE_DONE_MASK)

#define CCM_LPCG_STATUS1_CPU1_MODE_MASK          (0x30U)
#define CCM_LPCG_STATUS1_CPU1_MODE_SHIFT         (4U)
/*! CPU1_MODE - Domain1 Low Power Mode
 *  0b00..Run
 *  0b01..Wait
 *  0b10..Stop
 *  0b11..Suspend
 */
#define CCM_LPCG_STATUS1_CPU1_MODE(x)            (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU1_MODE_SHIFT)) & CCM_LPCG_STATUS1_CPU1_MODE_MASK)

#define CCM_LPCG_STATUS1_CPU1_MODE_REQUEST_MASK  (0x40U)
#define CCM_LPCG_STATUS1_CPU1_MODE_REQUEST_SHIFT (6U)
/*! CPU1_MODE_REQUEST - Domain1 request enter Low Power Mode
 *  0b0..No request
 *  0b1..Request from domain to enter Low Power Mode
 */
#define CCM_LPCG_STATUS1_CPU1_MODE_REQUEST(x)    (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU1_MODE_REQUEST_SHIFT)) & CCM_LPCG_STATUS1_CPU1_MODE_REQUEST_MASK)

#define CCM_LPCG_STATUS1_CPU1_MODE_DONE_MASK     (0x80U)
#define CCM_LPCG_STATUS1_CPU1_MODE_DONE_SHIFT    (7U)
/*! CPU1_MODE_DONE - Domain1 Low Power Mode task done
 *  0b0..Clock is not gated
 *  0b1..Clock is gated-off
 */
#define CCM_LPCG_STATUS1_CPU1_MODE_DONE(x)       (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU1_MODE_DONE_SHIFT)) & CCM_LPCG_STATUS1_CPU1_MODE_DONE_MASK)

#define CCM_LPCG_STATUS1_CPU2_MODE_MASK          (0x300U)
#define CCM_LPCG_STATUS1_CPU2_MODE_SHIFT         (8U)
/*! CPU2_MODE - Domain2 Low Power Mode
 *  0b00..Run
 *  0b01..Wait
 *  0b10..Stop
 *  0b11..Suspend
 */
#define CCM_LPCG_STATUS1_CPU2_MODE(x)            (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU2_MODE_SHIFT)) & CCM_LPCG_STATUS1_CPU2_MODE_MASK)

#define CCM_LPCG_STATUS1_CPU2_MODE_REQUEST_MASK  (0x400U)
#define CCM_LPCG_STATUS1_CPU2_MODE_REQUEST_SHIFT (10U)
/*! CPU2_MODE_REQUEST - Domain2 request enter Low Power Mode
 *  0b0..No request
 *  0b1..Request from domain to enter Low Power Mode
 */
#define CCM_LPCG_STATUS1_CPU2_MODE_REQUEST(x)    (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU2_MODE_REQUEST_SHIFT)) & CCM_LPCG_STATUS1_CPU2_MODE_REQUEST_MASK)

#define CCM_LPCG_STATUS1_CPU2_MODE_DONE_MASK     (0x800U)
#define CCM_LPCG_STATUS1_CPU2_MODE_DONE_SHIFT    (11U)
/*! CPU2_MODE_DONE - Domain2 Low Power Mode task done
 *  0b0..Clock is not gated
 *  0b1..Clock is gated-off
 */
#define CCM_LPCG_STATUS1_CPU2_MODE_DONE(x)       (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU2_MODE_DONE_SHIFT)) & CCM_LPCG_STATUS1_CPU2_MODE_DONE_MASK)

